package 생성자;

public class Memo {
	/*
	 * 객체가 생성 될 때
	 * 멤버 변수 값을 대입하면 됨.
	 * =>객체 생성 될 때 자동으로 호출 되는 메소드
	 * =>객체 생성 될 때 자동으로 처리해야 하는 부분
	 * =>객체 생성 될 때 자동으로 호출 된다고 해서 "생성자"
	 * =>생성자 = constructor
	 * =>public 클래스 이름()
	 * =>생성자 메소드 이름은 클래스 이름과 동일해야 한다.
	 * =>생성자 메소드이름은 대문자로 시작!
	 * =>생성자 메소드는 객체생성시 자동 호출!!
	 * =>생성자 메소드는 여러개 만들 수 있다.(ok)
	 * =>생성자 오버로딩(다형성)
	 * =>생성자가 하나도 없는 경우
	 *   파라메터 없는 기본 생성자가 자동으로 만들어진다.
	 * =>파라메터 없는 생성자를 "기본 생성자"라고 부른다.
	 * 
	 * 
	 * 상속 = 재사용
	 * Truck(변수) ---> Car(변수2, 메소드3)
	 * ----------      ----------------
	 * this			   super
	 * 현재 작업하는
	 * 프로그램을 나타냄
	 * 
	 */
	
}
