package java10;

public class Memo {
	
	/*
	 *  부품(클래스)을 사용하는 방법은?
	 *  1. JDK 4000개 이용.
	 *  2. 인터넷에서 다운로드 이용. mvnrepository.com
	 *  3. 내가 만들어 이용.
	 *  
	 *  자바 - 편하게, 간단하게, 쉽게 하자.
	 *  
	 *  전화기
	 *  -특징을 찾아서 부품을 만들어야 함.
	 *  -특징(attribute, property), 특성 , 속성
	 *  -정적 특성 : 모양, 크기, 회사 => 변수
	 *  -동적특성: 전화하다. 문자보내다. 알람을 맞추다.=> 메소드
	 *  
	 *  TV=> class
	 *  -정적특성: 전원버튼유무, 사이즈, 색 => 멤버 변수
	 *  		 전역 변수(global, 글로벌): 자동 초기화
	 *  		 주소가 들어가는 변수(null)
	 *  		 값이 들어가는 변수 (해당 타입으로)
	 *  		 <->(local, 로컬): 자동 초기화 x
	 *  -동적특성: 채널변셩하다, 소리를 조절하다, 잭연결하다
	 *  		 => 멤버 메소드
	 *  
	 *  
	 *  메소드를 만들 때 고려해야 할 사항
	 *  ---------------------------
	 *  -반환값의 유무
	 *  	-없는 경우: void => 명령을 했을 때 이행하고 끝내는 것.
	 *  	-있는 경우: 해당 타입,return => 명령을 했을 때 다시 돌아오는 무엇인가 있을 때.
	 *  
	 *  -입력값의 유무
	 *  
	 *  오버로딩 : 다형성, 메소드 이름 하나의 이름으로 쓸 수 있다.
	 *  오버라이딩: 재정의, 상속 받은 메소드를 변경해서 사용할 수 있다.
	 */
	
}
